In [1]:
import numpy as np
import pickle
import psycopg2 as pg
import pandas.io.sql as psql
import pandas as pd
import main

from typing import Union, List, Tuple

connection = pg.connect(host='pgsql-196447.vipserv.org', port=5432, dbname='wbauer_adb', user='wbauer_adb', password='adb2020')

In [3]:
df = pd.read_sql('select country from country where country ~ %(posix)s', params={'posix': '^P'}, con=connection)
df

       country
0     Pakistan
1     Paraguay
2         Peru
3  Philippines
4       Poland
5  Puerto Rico

In [14]:
df = pd.read_sql('select country from country where country ~ %(posix1)s AND country ~ %(posix2)s', params={'posix1': '^P', 'posix2': 's$'}, con=connection)
df

       country
0  Philippines

In [29]:
df = pd.read_sql('select title from film where title ~ %(posix)s', params={'posix': '[0-9]'}, con=connection)
df

Empty DataFrame
Columns: [title]
Index: []

In [30]:
df = pd.read_sql('select first_name, last_name from staff where first_name ~ %(posix1)s OR last_name ~ %(posix1)s', params={'posix1': '- '}, con=connection)
df

Empty DataFrame
Columns: [first_name, last_name]
Index: []

In [31]:
df = pd.read_sql('select first_name, last_name from staff', con=connection)
df

  first_name last_name
0       Mike   Hillyer
1        Jon  Stephens

In [34]:
df = pd.read_sql('select first_name, last_name from actor where last_name ~ %(posix1)s AND length(last_name)=5 ', params={'posix1': '^(P|C)'}, con=connection)
df

  first_name last_name
0         Ed     Chase
1       Burt     Posey
2    Kenneth     Pesci
3     Sidney     Crowe
4        Jon     Chase
5    Russell     Close

In [35]:
df = pd.read_sql('select title from film where title ~ %(posix1)s  ', params={'posix1': '(Trip|Alone)'}, con=connection)
df

           title
0     Alone Trip
1  Superfly Trip
2    Trip Newton
3   Varsity Trip

In [37]:
df = pd.read_sql('select first_name from actor where first_name ~ %(posix1)s ', params={'posix1': '^Al[a:z, 1:9]*'}, con=connection)
df

  first_name
0       Alec
1     Albert
2     Albert
3         Al
4       Alan

In [39]:
df = pd.read_sql('select first_name from actor where first_name ~* %(posix1)s ', params={'posix1':'^al[a:z,1:9] *'}, con=connection)
df

  first_name
0       Alan

In [7]:
main.film_title_case_insensitive(['Giant', 'Harry', 'Birdcage', 'Iron'])
## TODO: make this work

NameError: name 'df_end' is not defined

In [4]:
main.film_cast('Alone Trip')
## TODO: make this work

DatabaseError: Execution failed on sql 'select first_name, last_name, actor_id from actor where actor_id in (select film_id from film_actor where film_id in (select film_id from film where title LIKE @title)) order by last_name asc, first_name asc': operator does not exist: @ character varying
LINE 1: ..._id in (select film_id from film where title LIKE @title)) o...
                                                             ^
HINT:  No operator matches the given name and argument type(s). You might need to add explicit type casts.

In [ ]:
main.film_in_category_case_insensitive('action')
## TODO: make this work

In [ ]:
main.film_in_category('Action')
## TODO: make this work